frontend/controllers/ProfileController.php

		 public function actionUpdate()
		 {
		 		if ($model = Profile::find()->where(['user_id' =>

		 		Yii::$app->user->identity->id])->one()) {

		 		if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
SELECT * FROM `profile` WHERE `user_id`=1

    protected function findModel($id)
    {
        if (($model = Profile::findOne($id)) !== null) {
---
SELECT * FROM `profile` WHERE `id`='1'