frontend/views/layouts/main.php

        $menuItems[] = ['label' => 'Login', 'url' => ['/site/login']];
    } else {
	    $menuItems[] = ['label' => 'post', 'url' =>['/post/index']];
        $menuItems[] = [
            'label' => 'Logout (' . Yii::$app->user->identity->profile->first_name . ')',
            'url' => ['/site/logout'],
            'linkOptions' => ['data-method' => 'post']
        ];
---
SELECT * FROM `profile` WHERE `user_id`=1