frontend/models/Profile.php

SELECT * FROM `gender`
---
	public static function getGenderList() {
		$droptions = Gender::find()->asArray()->all();